Revit 2025 API
CheckoutElementsRequestTooLargeException Class
Exception is thrown when too many elements are requested for checkout
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.CentralModelException
 Autodesk.Revit.Exceptions.CheckoutElementsRequestTooLargeException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
[SerializableAttribute]
public class CheckoutElementsRequestTooLargeException : CentralModelException
<SerializableAttribute>
Public Class CheckoutElementsRequestTooLargeException
	Inherits CentralModelException
[SerializableAttribute]
public ref class CheckoutElementsRequestTooLargeException : public CentralModelException
[<SerializableAttribute>]
type CheckoutElementsRequestTooLargeException =
    class
        inherit CentralModelException
    end
The CheckoutElementsRequestTooLargeException type exposes the following members.
Properties
Name | Description
Data | Gets a collection of key/value pairs that provide additional user-defined information about the exception.
(Inherited from Exception)
FunctionId | The information of the function throwing the exception.
(Inherited from ApplicationException)
HelpLink | Gets or sets a link to the help file associated with this exception.
(Inherited from Exception)
HResult | Gets or sets HRESULT, a coded numerical value that is assigned to a specific exception.
(Inherited from Exception)
InnerException | Gets the Exception instance that caused the current exception.
(Inherited from Exception)
Message | Gets a message that describes the current exception.
(Inherited from Exception)
Source | Gets or sets the name of the application or the object that causes the error.
(Inherited from Exception)
StackTrace | Gets a string representation of the immediate frames on the call stack.
(Inherited from Exception)
TargetSite | Gets the method that throws the current exception.
(Inherited from Exception)
Top
Methods
Name | Description
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBaseException | When overridden in a derived class, returns the Exception that is the root cause of one or more subsequent exceptions.
(Inherited from Exception)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides CentralModelException.GetObjectData(SerializationInfo, StreamingContext))
GetType | Gets the runtime type of the current instance.
(Inherited from Exception)
ToString | Creates and returns a string representation of the current exception.
(Inherited from Exception)
Top
Example
void HandleCheckoutElementsRequestTooLargeException(Document doc)
{
   FilteredElementCollector collector = new FilteredElementCollector(doc);
   ICollection<ElementId> rooms = collector.WherePasses(new RoomFilter()).ToElementIds();
   try
   {
      ICollection<ElementId> checkoutelements = WorksharingUtils.CheckoutElements(doc, rooms);
   }
   catch (Autodesk.Revit.Exceptions.CheckoutElementsRequestTooLargeException)
   {
      IEnumerable<WorksetId> worksets = rooms.Select(elemId => doc.GetWorksetId(elemId)).Distinct();
      TaskDialog dlg = new TaskDialog("Elements can't be checked out")
      {
         MainInstruction = $"You are trying to check out a large number of elements. Instead check out the following {worksets.Count()} worksets:",
         MainContent = string.Join(", ", worksets),
      };
      dlg.Show();
      TransactWithCentralOptions twcOptions = new TransactWithCentralOptions();
      ISet<WorksetId> worksetsCheckedout = WorksharingUtils.CheckoutWorksets(doc, worksets.ToHashSet(), twcOptions);
      TaskDialog.Show(
            title: "Worksets are checked out",
            mainInstruction: $"{worksetsCheckedout.Count} worksets are checked out.");
   }
}
Private Sub HandleCheckoutElementsRequestTooLargeException(ByVal doc As Document)
    Dim collector As FilteredElementCollector = New FilteredElementCollector(doc)
    Dim rooms As ICollection(Of ElementId) = collector.WherePasses(New RoomFilter()).ToElementIds()
    Try
        Dim checkoutelements As ICollection(Of ElementId) = WorksharingUtils.CheckoutElements(doc, rooms)
    Catch __unusedCheckoutElementsRequestTooLargeException1__ As Autodesk.Revit.Exceptions.CheckoutElementsRequestTooLargeException
        Dim worksets As IEnumerable(Of WorksetId) = rooms.[Select](Function(elemId) doc.GetWorksetId(elemId)).Distinct()
        Dim dlg As TaskDialog = New TaskDialog("Elements can't be checked out") With {
    .MainInstruction = $"You are trying to check out a large number of elements. Instead check out the following {worksets.Count()} worksets:",
    .MainContent = String.Join(", ", worksets)
}
        dlg.Show()
        Dim twcOptions As TransactWithCentralOptions = New TransactWithCentralOptions()
        Dim worksetsCheckedout As ISet(Of WorksetId) = WorksharingUtils.CheckoutWorksets(doc, worksets.ToHashSet(), twcOptions)
        TaskDialog.Show(title:="Worksets are checked out", mainInstruction:=$"{worksetsCheckedout.Count} worksets are checked out.")
    End Try
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Autodesk.Revit.Exceptions Namespace